Revit 2027 API
ISaveSharedCoordinatesCallbackForUnloadLocally.GetSaveModifiedLinksOptionForUnloadLocally Method
 Determines whether Revit should save the link or not prior to unloading the link locally.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType link
)
Function GetSaveModifiedLinksOptionForUnloadLocally (
	link As RevitLinkType
) As SaveModifiedLinksOptionsForUnloadLocally
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType^ link
)
abstract GetSaveModifiedLinksOptionForUnloadLocally :
        link : RevitLinkType -> SaveModifiedLinksOptionsForUnloadLocally
Parameters
link RevitLinkType
 The Revit link which has modified shared coordinates.
Return Value
SaveModifiedLinksOptionsForUnloadLocally
 The saving option when unloading locally a linked file which has been modified in-memory by shared coordinates operations.
See Also
Reference
ISaveSharedCoordinatesCallbackForUnloadLocally Interface
Autodesk.Revit.DB Namespace